In [1]:
#dependencies
import pandas as pd
import numpy as np

In [2]:
#map to the path of data set
data_file = "purchase_data.csv"

In [3]:
# read the file with pandas data frame; pymoli_df["Price"] = pymoli_df["Price"].map("${:.2f}".format)...
#if used, error in average price calc as can't characterize string to float!!!!

pymoli_df = pd.read_csv(data_file)

pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
# # Player Count total Number of Players
total_players = pymoli_df ["SN"].nunique()
print("Number of total players " + str(total_players))

Number of total players 576

In [5]:
###Purchase Analysis (Total)---------------------------------------------------------------------------------------------------

In [6]:
#Number of Unique Items
unique_items = len(pymoli_df["Item ID"].unique())
unique_items

183

In [7]:
# Average Purchase Price
average_price = pymoli_df["Price"].mean()
average_price

3.050987179487176

In [8]:
#Total Number of Purchases
number_of_purchases = len(pymoli_df)
number_of_purchases

780

In [9]:
#Total Revenue
total_revenue = pymoli_df ["Price"].sum()
total_revenue

2379.77

In [10]:
###***purchasing Analysis (Total) summary_df1
df1 = pd.DataFrame({
    "Number of Unique Items": [unique_items],
    "Average Price" :[average_price],
    "Number of Purchases" :[number_of_purchases],
    "Total Revenue" :[total_revenue],
})
                                    
df1.head()

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

In [11]:
###Gender Demographics----------------------------------------------------------------------------------------------------------

In [12]:
# Count of Male, Female, Other/ Non-Disclosed Players
gender_count = pymoli_df ["Gender"].value_counts()
gender_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [13]:
#Gender Percentage
gender_percentage = (gender_count/total_players)*100
gender_percentage.round(2)

Male                     113.19
Female                    19.62
Other / Non-Disclosed      2.60
Name: Gender, dtype: float64

In [14]:
###***Gender Demographic summary_df2
df2 = pd.DataFrame({"Gender Count": gender_count, "Gender Percentage": gender_percentage.round(2)})
    
df2.head()

                       Gender Count  Gender Percentage
Male                            652             113.19
Female                          113              19.62
Other / Non-Disclosed            15               2.60

In [15]:
###Purchasing Analysis (Gender)-------------------------------------------------------------------------------------------------

In [16]:
#Purchase Count by Gender
Purchase_Count_by_Gender = pymoli_df.groupby("Gender")["SN"].count()

Purchase_Count_by_Gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: SN, dtype: int64

In [17]:
#Average Purchase Price by Gender
Average_Purchase_Price_by_Gender = pymoli_df.groupby("Gender")["Price"].mean()
Average_Purchase_Price_by_Gender.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [18]:
#Total Purchase Value by Gender
Total_Purchase_Value_by_Gender = pymoli_df.groupby("Gender")["Price"].sum()
Total_Purchase_Value_by_Gender.round(2)

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [19]:
#Average Purchase Total per Person by Gender
Average_Purchase_Total_perPerson_by_Gender = Total_Purchase_Value_by_Gender/ gender_count
Average_Purchase_Total_perPerson_by_Gender.round(2)

Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
dtype: float64

In [20]:
###***Purchasing Analysis (Gender)_df3

In [21]:
#Purchasing Analysis by Gender
df3 = pd.DataFrame({"Purchase Count" : Purchase_Count_by_Gender, 
                    "Average Purchase Price" : Average_Purchase_Price_by_Gender.round(2),
                    "Total Purchase Value" : Total_Purchase_Value_by_Gender, 
                    "Avg Purchase Total per Person" : Average_Purchase_Total_perPerson_by_Gender.round(2)})

df3.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Purchase Total per Person
Gender,,,,
Female,113,3.20,361.94,3.20
Male,652,3.02,1967.64,3.02
Other / Non-Disclosed,15,3.35,50.19,3.35

In [22]:
### Age Demographics * The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)

In [23]:
#Establish bins for age groups

age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [24]:
#Categorize the existing players using the age bins. Hint: use pd.cut()

pymoli_df["Age Groups"] = pd.cut(pymoli_df["Age"], age_bins, labels = group_names)
pymoli_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Groups
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [25]:
#Calculate count per age group

count_per_age_group = pymoli_df.groupby("Age Groups")["SN"].count()

count_per_age_group

Age Groups
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [26]:
# Calculate percentage of age grp count

AgeGroups_percentage = (count_per_age_group/total_players)*100
AgeGroups_percentage.round(2)

Age Groups
<10       3.99
10-14     4.86
15-19    23.61
20-24    63.37
25-29    17.53
30-34    12.67
35-39     7.12
40+       2.26
Name: SN, dtype: float64

In [27]:
#summary data with Percentage of Players and Total Count_df4

df4 = pd.DataFrame({"Player Percentage per age group" : AgeGroups_percentage.round(2), 
                    "Age Group Count" : count_per_age_group})

df4

            Player Percentage per age group  Age Group Count
Age Groups
<10                                    3.99               23
10-14                                  4.86               28
15-19                                 23.61              136
20-24                                 63.37              365
25-29                                 17.53              101
30-34                                 12.67               73
35-39                                  7.12               41
40+                                    2.26               13

In [28]:
# Purchase Count by age group
purchase_count = pymoli_df.groupby("Age Groups")["SN"].count()
purchase_count

Age Groups
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [29]:
# Average Purchase Price by Age Groups

Average_Purchase_Price_by_Age_Groups = pymoli_df.groupby("Age Groups")["Price"].mean()
Average_Purchase_Price_by_Age_Groups.round(2)

Age Groups
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
Name: Price, dtype: float64

In [30]:
# Total Purchase Value

Total_Purchase_Price_by_Age_Groups = pymoli_df.groupby("Age Groups")["Price"].sum()
Total_Purchase_Price_by_Age_Groups.round(2)

Age Groups
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [31]:
# Average Purchase Total per Person by Age Group

Average_Purchase_Total_per_Person_per_Age_Groups = Total_Purchase_Price_by_Age_Groups/count_per_age_group
Average_Purchase_Total_per_Person_per_Age_Groups.round(2)

Age Groups
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
dtype: float64

In [32]:
#Purchase Analysis (Age)_df5

df5 = pd.DataFrame({"Purchase Count" : purchase_count, 
                    "Average Purchase Price" : Average_Purchase_Price_by_Age_Groups.round(2), 
                    "Total Purchase Value" : Total_Purchase_Price_by_Age_Groups, 
                    "Average Purchase Total per Person": Average_Purchase_Total_per_Person_per_Age_Groups.round(2)})
df5.head(10)

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Age Groups,,,,
<10,23,3.35,77.13,3.35
10-14,28,2.96,82.78,2.96
15-19,136,3.04,412.89,3.04
20-24,365,3.05,1114.06,3.05
25-29,101,2.90,293.00,2.90
30-34,73,2.93,214.00,2.93
35-39,41,3.60,147.67,3.60
40+,13,2.94,38.24,2.94

In [33]:
### Top Five Spenders

In [34]:
# Purchase_Count by All
df6 = pymoli_df ["SN"].value_counts()
df6

Lisosia93        5
Iral74           4
Idastidru52      4
Siallylis44      3
Ilarin91         3
Strithenu87      3
Tyidaim51        3
Lisim78          3
Iri67            3
Haillyrgue51     3
Sondastsda82     3
Pheodaisun84     3
Hiaral50         3
Chamimla85       3
Aelin32          3
Raesty92         3
Idai61           3
Lisopela58       3
Iskadarya95      3
Saistyphos30     3
Umolrian85       3
Zontibe81        3
Chadolyla44      3
Tyisur83         3
Silaera56        3
Phyali88         3
Hada39           3
Aina42           3
Ialallo29        3
Rarallo90        3
                ..
Hariphos58       1
Chanirra64       1
Chanjask65       1
Ililsasya43      1
Chamassasya86    1
Phaedue89        1
Lisista63        1
Eulae84          1
Assehoan67       1
Laedallo55       1
Eusri44          1
Ethralista69     1
Seuthep89        1
Cosadar58        1
Aidai73          1
Frichilsa31      1
Marughi89        1
Lisiriya82       1
Malil90          1
Undotesta33      1
Yarithrin84      1
Aelaria33        1
Hallysucal81     1
Chamalo71        1
Rairin89         1
Frichynde86      1
Malon70          1
Qilanrion65      1
Inasuir29        1
Ialidru40        1
Name: SN, Length: 576, dtype: int64

In [35]:
# Total Purchase Price by All

df7 = pymoli_df.groupby ("SN")["Price"].sum()

df7

SN
Adairialis76       2.28
Adastirin33        4.48
Aeda94             4.91
Aela59             4.32
Aelaria33          1.79
Aelastirin39       7.29
Aelidru27          1.09
Aelin32            8.98
Aelly27            6.79
Aellynun67         3.74
Aellyria80         3.08
Aelollo59          5.63
Aenarap34          2.96
Aeral43            4.40
Aeral68            4.00
Aeral97            4.80
Aeralria27         4.09
Aeralstical35      2.96
Aeri84             1.61
Aerillorin70       3.33
Aerithllora36      8.64
Aerithnucal56      4.40
Aerithnuphos61     4.91
Aerithriaphos45    1.56
Aerithriaphos46    2.18
Aesri53            1.76
Aesty53            3.91
Aestysu37          5.38
Aesur96            2.21
Aesurstilis64      1.03
                   ...
Undosia27          3.77
Undosian34         8.30
Undotesta33        4.74
Wailin72           2.73
Yadacal26          6.54
Yadaisuir65        4.09
Yadam35            2.48
Yadanu52           2.38
Yadaphos40         5.35
Yalae81            6.69
Yalaeria91         1.06
Yaliru88           3.03
Yalo85             3.65
Yalostiphos68      4.40
Yana46             3.55
Yarithllodeu72     3.75
Yarithrgue83       3.45
Yarithrin84        4.14
Yarithsurgue62     4.94
Yarolwen77         4.43
Yasrisu92          3.44
Yastyriaphos75     4.75
Yasur35            4.48
Yasur85            1.10
Yathecal72         3.46
Yathecal82         6.22
Yathedeu43         6.02
Yoishirrala98      4.58
Zhisrisu83         7.89
Zontibe81          8.03
Name: Price, Length: 576, dtype: float64

In [36]:
# Average Purchase Price by All
df8 = df7/df6
df8

Adairialis76       2.280000
Adastirin33        4.480000
Aeda94             4.910000
Aela59             4.320000
Aelaria33          1.790000
Aelastirin39       3.645000
Aelidru27          1.090000
Aelin32            2.993333
Aelly27            3.395000
Aellynun67         3.740000
Aellyria80         3.080000
Aelollo59          2.815000
Aenarap34          2.960000
Aeral43            4.400000
Aeral68            4.000000
Aeral97            4.800000
Aeralria27         4.090000
Aeralstical35      2.960000
Aeri84             1.610000
Aerillorin70       3.330000
Aerithllora36      4.320000
Aerithnucal56      4.400000
Aerithnuphos61     4.910000
Aerithriaphos45    1.560000
Aerithriaphos46    2.180000
Aesri53            1.760000
Aesty53            1.955000
Aestysu37          2.690000
Aesur96            2.210000
Aesurstilis64      1.030000
                     ...
Undosia27          3.770000
Undosian34         4.150000
Undotesta33        4.740000
Wailin72           2.730000
Yadacal26          3.270000
Yadaisuir65        4.090000
Yadam35            2.480000
Yadanu52           2.380000
Yadaphos40         2.675000
Yalae81            3.345000
Yalaeria91         1.060000
Yaliru88           3.030000
Yalo85             3.650000
Yalostiphos68      4.400000
Yana46             3.550000
Yarithllodeu72     3.750000
Yarithrgue83       3.450000
Yarithrin84        4.140000
Yarithsurgue62     4.940000
Yarolwen77         4.430000
Yasrisu92          3.440000
Yastyriaphos75     4.750000
Yasur35            4.480000
Yasur85            1.100000
Yathecal72         3.460000
Yathecal82         2.073333
Yathedeu43         3.010000
Yoishirrala98      4.580000
Zhisrisu83         3.945000
Zontibe81          2.676667
Length: 576, dtype: float64

In [37]:
#create spender_df9 with df6, df7, df8

df9 = pd.DataFrame({"Purchase Count": df6,
                    "Average Purchase Price" : df8,
                    "Total Purchase Value": df7})

df9.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [38]:
# Identify the the top 5 spenders in the game by total purchase value

Top_five_spenders = df9.sort_values(["Total Purchase Value"], ascending=False)
Top_five_spenders.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [39]:
# MOST POPULAR item analysis

# Purchase Count
df10 = pymoli_df.groupby(["Item ID", "Item Name"])["SN"].count()

#Item Price
df11 = pymoli_df.groupby(["Item ID", "Item Name"])["Price"].mean()

#Total Purchase Value
df12 = pymoli_df.groupby(["Item ID", "Item Name"])["Price"].sum()

# Convert to DataFrame

df13 = pd.DataFrame({"Purchase Count":df10,
                     "Item Price":df11,
                     "Total Purchase Value":df12,
                    })

df13.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4        1.28                  5.12
1       Crucifer                         3        3.26                  9.78
2       Verdict                          6        2.48                 14.88
3       Phantomlight                     6        2.49                 14.94
4       Bloodlord's Fetish               5        1.70                  8.50

In [40]:
Most_Popular_items = df13.sort_values(["Purchase Count"], ascending=False)
Most_Popular_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [41]:
Most_Profitable_items = df13.sort_values(["Total Purchase Value"], ascending=False)
Most_Profitable_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80

In [42]:
### Three observable trends based on the data:

# * Most Players are Male and most purchases are made by Male; they contributed to almost 83% of revenue. 
# * Most players and buyers are in age group range 20-24 years; almost 63.4% of total players are in this age group.
# * Most popular item was also the most profitable item, "Oathbreaker, Last Hope of the Breaking Storm"